cmsis-svd/cmsis-svd/data/Atmel/ATSAM3U2E.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RSTC</name>
      <version>6373A</version>
      <description>Reset Controller</description>
      <groupName>SYSC</groupName>
      <prependToName>RSTC_</prependToName>
      <baseAddress>0x400E1200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>PROCRST</name>
              <description>Processor Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PERRST</name>
              <description>Peripheral Reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EXTRST</name>
              <description>External Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>KEY</name>
              <description>Password</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>URSTS</name>
              <description>User Reset Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTTYP</name>
              <description>Reset Type</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NRSTL</name>
              <description>NRST Pin Level</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SRCMP</name>
              <description>Software Reset Command in Progress</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>URSTEN</name>
              <description>User Reset Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>URSTIEN</name>
              <description>User Reset Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERSTL</name>
              <description>External Reset Length</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEY</name>
              <description>Password</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SUPC</name>
      <version>6452S</version>
      <description>Supply Controller</description>
      <groupName>SYSC</groupName>
      <prependToName>SUPC_</prependToName>
      <baseAddress>0x400E1210</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Supply Controller Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>VROFF</name>
              <description>Voltage Regulator Off</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>no effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_VREG</name>
                  <description>if KEY is correct, asserts the vddcore_nreset and stops the voltage regulator.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTALSEL</name>
              <description>Crystal Oscillator Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>no effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYSTAL_SEL</name>
                  <description>if KEY is correct, switches the slow clock on the crystal oscillator output.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY</name>
              <description>Password</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation.</description>
                  <value>0xA5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SMMR</name>
          <description>Supply Controller Supply Monitor Mode Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SMTH</name>
              <description>Supply Monitor Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMSMPL</name>
              <description>Supply Monitor Sampling Period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMD</name>
                  <description>Supply Monitor disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSM</name>
                  <description>Continuous Supply Monitor</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32SLCK</name>
                  <description>Supply Monitor enabled one SLCK period every 32 SLCK periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256SLCK</name>
                  <description>Supply Monitor enabled one SLCK period every 256 SLCK periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2048SLCK</name>
                  <description>Supply Monitor enabled one SLCK period every 2,048 SLCK periods</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMRSTEN</name>
              <description>Supply Monitor Reset Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>the core reset signal "vddcore_nreset" is not affected when a supply monitor detection occurs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>the core reset signal, vddcore_nreset is asserted when a supply monitor detection occurs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMIEN</name>
              <description>Supply Monitor Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>the SUPC interrupt signal is not affected when a supply monitor detection occurs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>the SUPC interrupt signal is asserted when a supply monitor detection occurs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Supply Controller Mode Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00005A00</resetValue>
          <fields>
            <field>
              <name>BODRSTEN</name>
              <description>Brownout Detector Reset Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>the core reset signal "vddcore_nreset" is not affected when a brownout detection occurs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>the core reset signal, vddcore_nreset is asserted when a brownout detection occurs.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODDIS</name>
              <description>Brownout Detector Disable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>the core brownout detector is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>the core brownout detector is disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDIORDY</name>
              <description>VDDIO Ready</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDIO_REMOVED</name>
                  <description>VDDIO is removed (used before going to backup mode when backup batteries are used)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDIO_PRESENT</name>
                  <description>VDDIO is present (used before going to backup mode when backup batteries are used)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSCBYPASS</name>
              <description>Oscillator Bypass</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>no effect. Clock selection depends on XTALSEL value.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>the 32-KHz XTAL oscillator is selected and is put in bypass mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY</name>
              <description>Password Key</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation.</description>
                  <value>0xA5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WUMR</name>
          <description>Supply Controller Wake-up Mode Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FWUPEN</name>
              <description>Force Wake-up Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>the Force Wake-up pin has no wake-up effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>the Force Wake-up pin low forces the wake-up of the core power supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMEN</name>
              <description>Supply Monitor Wake-up Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>the supply monitor detection has no wake-up effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>the supply monitor detection forces the wake-up of the core power supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTTEN</name>
              <description>Real Time Timer Wake-up Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>the RTT alarm signal has no wake-up effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>the RTT alarm signal forces the wake-up of the core power supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCEN</name>
              <description>Real Time Clock Wake-up Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ENABLE</name>
                  <description>the RTC alarm signal has no wake-up effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>the RTC alarm signal forces the wake-up of the core power supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FWUPDBC</name>
              <description>Force Wake-up Debouncer Period</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMMEDIATE</name>
                  <description>Immediate, no debouncing, detected active at least on one Slow Clock edge.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_SCLK</name>
                  <description>FWUP shall be low for at least 3 SLCK periods</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_SCLK</name>
                  <description>FWUP shall be low for at least 32 SLCK periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512_SCLK</name>
                  <description>FWUP shall be low for at least 512 SLCK periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4096_SCLK</name>
                  <description>FWUP shall be low for at least 4,096 SLCK periods</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32768_SCLK</name>
                  <description>FWUP shall be low for at least 32,768 SLCK periods</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPDBC</name>
              <description>Wake-up Inputs Debouncer Period</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMMEDIATE</name>
                  <description>Immediate, no debouncing, detected active at least on one Slow Clock edge.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 3 SLCK periods</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 32 SLCK periods</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 512 SLCK periods</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4096_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 4,096 SLCK periods</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32768_SCLK</name>
                  <description>WKUPx shall be in its active state for at least 32,768 SLCK periods</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
